Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21G17A.xml
          </instance>
        </module>
        <module name="EIC" id="U2254" version="2.0.1">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002400"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA16"/>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PA30"/>
              <signal group="EXTINT" index="10" function="A" pad="PB10"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PA31"/>
              <signal group="EXTINT" index="11" function="A" pad="PB11"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PA24"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="13" function="A" pad="PA25"/>
              <signal group="EXTINT" index="14" function="A" pad="PA14"/>
              <signal group="EXTINT" index="15" function="A" pad="PA27"/>
              <signal group="EXTINT" index="15" function="A" pad="PA15"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2256" version="1.0.0">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x43000000"/>
            <parameters>
              <param name="CHANNELS" value="12"/>
              <param name="CHANNELS_BITS" value="4"/>
              <param name="CHANNELS_MSB" value="11"/>
              <param name="EXTEVT_NUM" value="0"/>
              <param name="GENERATORS" value="83"/>
              <param name="GENERATORS_BITS" value="7"/>
              <param name="USERS" value="45"/>
              <param name="USERS_BITS" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2122" version="1.1.1">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001800"/>
            <signals>
              <signal group="IO" index="0" function="H" pad="PB22"/>
              <signal group="IO" index="0" function="H" pad="PA14"/>
              <signal group="IO" index="0" function="H" pad="PA27"/>
              <signal group="IO" index="0" function="H" pad="PA30"/>
              <signal group="IO" index="1" function="H" pad="PB23"/>
              <signal group="IO" index="1" function="H" pad="PA15"/>
              <signal group="IO" index="2" function="H" pad="PA16"/>
              <signal group="IO" index="3" function="H" pad="PA17"/>
              <signal group="IO" index="4" function="H" pad="PA10"/>
              <signal group="IO" index="4" function="H" pad="PA20"/>
              <signal group="IO" index="4" function="H" pad="PB10"/>
              <signal group="IO" index="5" function="H" pad="PA11"/>
              <signal group="IO" index="5" function="H" pad="PA21"/>
              <signal group="IO" index="5" function="H" pad="PB11"/>
              <signal group="IO" index="6" function="H" pad="PA22"/>
              <signal group="IO" index="7" function="H" pad="PA23"/>
            </signals>
            <parameters>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="9"/>
              <param name="GEN_NUM_MSB" value="8"/>
              <param name="GEN_SOURCE_NUM_MSB" value="8"/>
              <param name="NUM" value="36"/>
              <param name="SOURCE_BITS" value="4"/>
              <param name="SOURCE_DFLL48M" value="7"/>
              <param name="SOURCE_FDPLL" value="8"/>
              <param name="SOURCE_GCLKGEN1" value="2"/>
              <param name="SOURCE_GCLKIN" value="1"/>
              <param name="SOURCE_NUM" value="9"/>
              <param name="SOURCE_OSCULP32K" value="3"/>
              <param name="SOURCE_OSC16M" value="6"/>
              <param name="SOURCE_OSC32K" value="4"/>
              <param name="SOURCE_XOSC" value="0"/>
              <param name="SOURCE_XOSC32K" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="MCLK" id="U2234" version="1.0.0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x40000400"/>
            <parameters>
              <param name="CTRLA_MCSEL_GCLK" value="1"/>
              <param name="CTRLA_MCSEL_OSC8M" value="0"/>
              <param name="MCLK_CLK_APB_NUM" value="5"/>
              <param name="SYSTEM_CLOCK" value="4000000"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="HPB3" bit="3"/>
                <clock name="HPB4" bit="4"/>
                <clock name="DSU" bit="5"/>
                <clock name="NVMCTRL" bit="8"/>
                <clock name="HMCRAMCHS" bit="9"/>
                <clock name="HMCRAMCLP" bit="10"/>
                <clock name="DMAC" bit="11"/>
                <clock name="USB" bit="12"/>
                <clock name="PICOPRAM" bit="13"/>
                <clock name="PAC" bit="14"/>
                <clock name="NVMCTRL_PICACHU" bit="15"/>
                <clock name="L2HBRIDGES_H" bit="16"/>
                <clock name="H2LBRIDGES_H" bit="17"/>
                <clock name="HMCRAMCHS_AHBSETUPKEEPER" bit="18"/>
                <clock name="HMCRAMCHS_HMATRIXLP2HMCRAMCHSBRIDGE" bit="19"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="MTB" id="U2002" version="1.0.0">
          <instance name="MTB">
            <register-group name="MTB" name-in-module="MTB" address-space="base" offset="0x41006000"/>
