Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21G17A.xml
          </instance>
        </module>
        <module name="NVMCTRL" id="U2207" version="3.0.2">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <signals>
              <signal group="MARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="FACTORY_WORD_IMPLEMENTED_MASK" value="0XC0000007FFFFFFFF"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="USER_PAGE_OFFSET" value="0x00800000"/>
              <param name="USER_WORD_IMPLEMENTED_MASK" value="0XC01FFFFFFFFFFFFF"/>
              <param name="RWWEE_PAGES" value="128"/>
              <param name="RWW_EEPROM_ADDR" value="0x00400000"/>
              <param name="RWW_EEPROM_SIZE" value="4096"/>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="2048"/>
              <param name="PAGES_PR_REGION" value="128"/>
                  <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
                  <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
                  <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
                  <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
                  <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
                  <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
                  <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2207" version="3.0.2">
          <instance name="FUSES">
            <register-group name="OTP1_FUSES" name-in-module="OTP1_FUSES" address-space="fuses" offset="0x00806000"/>
            <register-group name="OTP5_FUSES" name-in-module="OTP5_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="TEMP_LOG_FUSES" name-in-module="TEMP_LOG_FUSES" address-space="fuses" offset="0x00806030"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="OPAMP" id="U2237" version="1.0.0">
          <instance name="OPAMP">
            <register-group name="OPAMP" name-in-module="OPAMP" address-space="base" offset="0x43001800"/>
            <signals>
              <signal group="OANEG" index="0" function="B_OPAMP" pad="PA02"/>
              <signal group="OANEG" index="2" function="B_OPAMP" pad="PB08"/>
              <signal group="OAOUT" index="0" function="B_OPAMP" pad="PA07"/>
              <signal group="OAOUT" index="2" function="B_OPAMP" pad="PA04"/>
              <signal group="OAPOS" index="0" function="B_OPAMP" pad="PA06"/>
              <signal group="OAPOS" index="1" function="B_OPAMP" pad="PB09"/>
              <signal group="OAPOS" index="2" function="B_OPAMP" pad="PA05"/>
              <signal group="OAPOT" index="0" function="OPAMP_TEST" pad="PA03"/>
              <signal group="TENOUT" index="0" function="OPAMP_TEST" pad="PB10"/>
              <signal group="TENOUT" index="1" function="OPAMP_TEST" pad="PB11"/>
              <signal group="TENOUT" index="2" function="OPAMP_TEST" pad="PA09"/>
              <signal group="TRDYOUT" index="0" function="OPAMP_TEST" pad="PA10"/>
              <signal group="TRDYOUT" index="1" function="OPAMP_TEST" pad="PA11"/>
              <signal group="TRDYOUT" index="2" function="OPAMP_TEST" pad="PA12"/>
            </signals>
          </instance>
        </module>
        <module name="OSCCTRL" id="U2119" version="1.1.0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x40000C00"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PA14"/>
              <signal group="XOUT" function="XOUT" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DFLL48M_COARSE_MSB" value="5"/>
              <param name="DFLL48M_FINE_MSB" value="9"/>
              <param name="DFLL48M_VERSION" value="0x320"/>
              <param name="FDPLL_VERSION" value="0x200"/>
              <param name="OSC16M_VERSION" value="0x100"/>
              <param name="XOSC_VERSION" value="0x120"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="U2246" version="1.1.0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" version="1.1.0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x44000000"/>
            <parameters>
              <param name="HPB_NUM" value="5"/>
              <param name="INTFLAG_NUM" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2240" version="1.0.1">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000000"/>
            <signals>
              <signal group="DEBUG_TEST" index="0" function="PM_TEST" pad="PA02"/>
              <signal group="DEBUG_TEST" index="1" function="PM_TEST" pad="PA03"/>
              <signal group="DEBUG_TEST" index="2" function="PM_TEST" pad="PA04"/>
              <signal group="DEBUG_TEST" index="3" function="PM_TEST" pad="PA05"/>
              <signal group="DEBUG_TEST" index="4" function="PM_TEST" pad="PA06"/>
              <signal group="DEBUG_TEST" index="5" function="PM_TEST" pad="PA07"/>
              <signal group="DEBUG_TEST" index="6" function="PM_TEST" pad="PA08"/>
              <signal group="DEBUG_TEST" index="7" function="PM_TEST" pad="PA09"/>
              <signal group="DEBUG_TEST" index="8" function="PM_TEST" pad="PA10"/>
              <signal group="DEBUG_TEST" index="9" function="PM_TEST" pad="PA11"/>
              <signal group="DEBUG_TEST" index="10" function="PM_TEST" pad="PA12"/>
              <signal group="DEBUG_TEST" index="11" function="PM_TEST" pad="PA13"/>
              <signal group="DEBUG_TEST" index="12" function="PM_TEST" pad="PA14"/>
              <signal group="DEBUG_TEST" index="13" function="PM_TEST" pad="PA15"/>
              <signal group="DEBUG_TEST" index="14" function="PM_TEST" pad="PA16"/>
              <signal group="DEBUG_TEST" index="15" function="PM_TEST" pad="PA17"/>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="PD_NUM" value="3"/>
            </parameters>
          </instance>
        </module>
