Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21G17A.xml
        <module name="WDT" id="U2251" version="1.0.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40001C00"/>
          </instance>
        </module>
      <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module>
        <module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module>
        <module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt name="NonMaskableInt_IRQn" index="-14" caption="Non Maskable Interrupt"/>
        <interrupt name="HardFault_IRQn" index="-13" caption="Cortex-M0+ Hard Fault Interrupt"/>
        <interrupt name="SVCall_IRQn" index="-5" caption="Cortex-M0+ SV Call Interrupt"/>
        <interrupt name="PendSV_IRQn" index="-2" caption="Cortex-M0+ Pend SV Interrupt"/>
        <interrupt name="SysTick_IRQn" index="-1" caption="Cortex-M0+ System Tick Interrupt"/>
        <interrupt name="MCLK_IRQn" index="0" module-instance="MCLK"/>
        <interrupt name="OSCCTRL_IRQn" index="0" module-instance="OSCCTRL"/>
        <interrupt name="OSC32KCTRL_IRQn" index="0" module-instance="OSC32KCTRL"/>
        <interrupt name="PAC_IRQn" index="0" module-instance="PAC"/>
        <interrupt name="PM_IRQn" index="0" module-instance="PM"/>
        <interrupt name="SUPC_IRQn" index="0" module-instance="SUPC"/>
        <interrupt name="TAL_IRQn" index="0" module-instance="TAL"/>
        <interrupt name="WDT_IRQn" index="1" module-instance="WDT"/>
        <interrupt name="RTC_IRQn" index="2" module-instance="RTC"/>
        <interrupt name="EIC_IRQn" index="3" module-instance="EIC"/>
        <interrupt name="NVMCTRL_IRQn" index="4" module-instance="NVMCTRL"/>
        <interrupt name="DMAC_IRQn" index="5" module-instance="DMAC"/>
        <interrupt name="USB_IRQn" index="6" module-instance="USB"/>
        <interrupt name="EVSYS_IRQn" index="7" module-instance="EVSYS"/>
        <interrupt name="SERCOM0_IRQn" index="8" module-instance="SERCOM0"/>
        <interrupt name="SERCOM1_IRQn" index="9" module-instance="SERCOM1"/>
        <interrupt name="SERCOM2_IRQn" index="10" module-instance="SERCOM2"/>
        <interrupt name="SERCOM3_IRQn" index="11" module-instance="SERCOM3"/>
        <interrupt name="SERCOM4_IRQn" index="12" module-instance="SERCOM4"/>
        <interrupt name="SERCOM5_IRQn" index="13" module-instance="SERCOM5"/>
        <interrupt name="TCC0_IRQn" index="14" module-instance="TCC0"/>
        <interrupt name="TCC1_IRQn" index="15" module-instance="TCC1"/>
        <interrupt name="TCC2_IRQn" index="16" module-instance="TCC2"/>
        <interrupt name="TC0_IRQn" index="17" module-instance="TC0"/>
        <interrupt name="TC1_IRQn" index="18" module-instance="TC1"/>
        <interrupt name="TC4_IRQn" index="21" module-instance="TC4"/>
        <interrupt name="ADC_IRQn" index="22" module-instance="ADC"/>
        <interrupt name="AC_IRQn" index="23" module-instance="AC"/>
        <interrupt name="DAC_IRQn" index="24" module-instance="DAC"/>
        <interrupt name="PTC_IRQn" index="25" module-instance="PTC"/>
        <interrupt name="AES_IRQn" index="26" module-instance="AES"/>
        <interrupt name="TRNG_IRQn" index="27" module-instance="TRNG"/>
      </interrupts>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x10810006"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.0.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x10"/>
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x100"/>
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x200"/>
          <bitfield name="INVEI0" caption="Comparator 0 Input Event Invert Enable" mask="0x1000"/>
          <bitfield name="INVEI1" caption="Comparator 1 Input Event Invert Enable" mask="0x2000"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="COMP0" caption="Comparator 0" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0" mask="0x10"/>
        </register>
        <register name="STATUSA" offset="0x7" rw="R" size="1" initval="0x00" caption="Status A">
          <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1"/>
          <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2"/>
          <bitfield name="WSTATE0" caption="Window 0 Current State" mask="0x30" values="AC_STATUSA__WSTATE0"/>
        </register>
        <register name="STATUSB" offset="0x8" rw="R" size="1" initval="0x00" caption="Status B">
          <bitfield name="READY0" caption="Comparator 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="Comparator 1 Ready" mask="0x2"/>
        </register>
