Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21G17A.xml
        <register name="INTENSET" offset="0x6" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="ENCCMP" caption="Encryption Complete" mask="0x1"/>
          <bitfield name="GFMCMP" caption="GF Multiplication Complete" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x7" rw="RW" size="1" initval="0x00" caption="Interrupt Flag Status">
          <bitfield name="ENCCMP" caption="Encryption Complete" mask="0x1"/>
          <bitfield name="GFMCMP" caption="GF Multiplication Complete" mask="0x2"/>
        </register>
        <register name="DATABUFPTR" offset="0x8" rw="RW" size="1" initval="0x00" caption="Data buffer pointer">
          <bitfield name="INDATAPTR" caption="Input Data Pointer" mask="0x3"/>
        </register>
        <register name="DBGCTRL" offset="0x9" rw="W" size="1" initval="0x00" caption="Debug control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="KEYWORD" offset="0xC" rw="W" size="4" count="8" initval="0x00000000" caption="Keyword n">
        </register>
        <register name="INDATA" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="Indata">
        </register>
        <register name="INTVECTV" offset="0x3C" rw="W" size="4" count="4" initval="0x00000000" caption="Initialisation Vector n">
        </register>
        <register name="HASHKEY" offset="0x5C" rw="RW" size="4" count="4" initval="0x00000000" caption="Hash key n">
        </register>
        <register name="GHASH" offset="0x6C" rw="RW" size="4" count="4" initval="0x00000000" caption="Galois Hash n">
        </register>
        <register name="CIPLEN" offset="0x80" rw="RW" size="4" initval="0x00000000" caption="Cipher Length">
        </register>
        <register name="RANDSEED" offset="0x84" rw="RW" size="4" initval="0x00000000" caption="Random Seed">
        </register>
      </register-group>
      <value-group name="AES_INTENCLR__ENCCMP">
        <value name="0" caption="1 (no division)" value="0"/>
        <value name="1" caption="2" value="1"/>
        <value name="2" caption="4" value="2"/>
        <value name="3" caption="8" value="3"/>
      </value-group>
    </module>
    <module name="CCL" id="U2225" version="1.0.0" caption="Configurable Custom Logic">
      <register-group name="CCL" caption="Configurable Custom Logic">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
        </register>
        <register name="SEQCTRL" offset="0x4" rw="RW" size="1" count="2" initval="0x00" caption="SEQ Control x">
          <bitfield name="SEQSEL" caption="Sequential Selection" mask="0xF" values="CCL_SEQCTRL__SEQSEL"/>
        </register>
        <register name="LUTCTRL" offset="0x8" rw="RW" size="4" count="4" initval="0x00000000" caption="LUT Control x">
          <bitfield name="ENABLE" caption="LUT Enable" mask="0x2"/>
          <bitfield name="FILTSEL" caption="Filter Selection" mask="0x30" values="CCL_LUTCTRL__FILTSEL"/>
          <bitfield name="EDGESEL" caption="Edge Selection" mask="0x80"/>
          <bitfield name="INSEL0" caption="Input Selection 0" mask="0xF00" values="CCL_LUTCTRL__INSEL0"/>
          <bitfield name="INSEL1" caption="Input Selection 1" mask="0xF000"/>
          <bitfield name="INSEL2" caption="Input Selection 2" mask="0xF0000"/>
          <bitfield name="INVEI" caption="Input Event Invert" mask="0x100000"/>
          <bitfield name="LUTEI" caption="Event Input Enable" mask="0x200000"/>
          <bitfield name="LUTEO" caption="Event Output Enable" mask="0x400000"/>
          <bitfield name="TRUTH" caption="Truth Value" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="CCL_SEQCTRL__SEQSEL">
        <value name="DISABLE" caption="Sequential logic is disabled" value="0"/>
        <value name="DFF" caption="D flip flop" value="1"/>
        <value name="JK" caption="JK flip flop" value="2"/>
        <value name="LATCH" caption="D latch" value="3"/>
        <value name="RS" caption="RS latch" value="4"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL0">
        <value name="MASK" caption="Masked input" value="0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="1"/>
        <value name="LINK" caption="Linked LUT input source" value="2"/>
        <value name="EVENT" caption="Event in put source" value="3"/>
        <value name="IO" caption="I/O pin input source" value="4"/>
        <value name="AC" caption="AC input source" value="5"/>
        <value name="TC" caption="TC input source" value="6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="7"/>
        <value name="TCC" caption="TCC input source" value="8"/>
        <value name="SERCOM" caption="SERCOM inout source" value="9"/>
      </value-group>
    </module>
    <module name="DAC" id="U2244" version="1.1.0" caption="Digital-to-Analog Converter">
      <register-group name="DAC" caption="Digital-to-Analog Converter">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable DAC Controller" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="RW" size="1" initval="0x00" caption="Control B">
          <bitfield name="DIFF" caption="Differential mode enable" mask="0x1"/>
          <bitfield name="REFSEL" caption="Reference Selection for DAC0/1" mask="0x6" values="DAC_CTRLB__REFSEL"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="STARTEI0" caption="Start Conversion Event Input DAC 0" mask="0x1"/>
          <bitfield name="STARTEI1" caption="Start Conversion Event Input DAC 1" mask="0x2"/>
          <bitfield name="EMPTYEO0" caption="Data Buffer Empty Event Output DAC 0" mask="0x4"/>
          <bitfield name="EMPTYEO1" caption="Data Buffer Empty Event Output DAC 1" mask="0x8"/>
          <bitfield name="INVEI0" caption="Enable Invertion of DAC 0 input event" mask="0x10"/>
          <bitfield name="INVEI1" caption="Enable Invertion of DAC 1 input event" mask="0x20"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="UNDERRUN0" caption="Underrun Interrupt Enable for DAC 0" mask="0x1"/>
          <bitfield name="UNDERRUN1" caption="Underrun Interrupt Enable for DAC 1" mask="0x2"/>
          <bitfield name="EMPTY0" caption="Data Buffer 0 Empty Interrupt Enable" mask="0x4"/>
          <bitfield name="EMPTY1" caption="Data Buffer 1 Empty Interrupt Enable" mask="0x8"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="UNDERRUN0" caption="Underrun Interrupt Enable for DAC 0" mask="0x1"/>
          <bitfield name="UNDERRUN1" caption="Underrun Interrupt Enable for DAC 1" mask="0x2"/>
          <bitfield name="EMPTY0" caption="Data Buffer 0 Empty Interrupt Enable" mask="0x4"/>
          <bitfield name="EMPTY1" caption="Data Buffer 1 Empty Interrupt Enable" mask="0x8"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="UNDERRUN0" caption="DAC 0 Underrun" mask="0x1"/>
          <bitfield name="UNDERRUN1" caption="DAC 1 Underrun" mask="0x2"/>
          <bitfield name="EMPTY0" caption="Data Buffer 0 Empty" mask="0x4"/>
          <bitfield name="EMPTY1" caption="Data Buffer 1 Empty" mask="0x8"/>
        </register>
