Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21G17A.xml
        <register name="INTFLAG" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVR0" caption="Channel 0 Overrun" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun" mask="0x80"/>
          <bitfield name="OVR8" caption="Channel 8 Overrun" mask="0x100"/>
          <bitfield name="OVR9" caption="Channel 9 Overrun" mask="0x200"/>
          <bitfield name="OVR10" caption="Channel 10 Overrun" mask="0x400"/>
          <bitfield name="OVR11" caption="Channel 11 Overrun" mask="0x800"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection" mask="0x10000"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection" mask="0x20000"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection" mask="0x40000"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection" mask="0x80000"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection" mask="0x100000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection" mask="0x200000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection" mask="0x400000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection" mask="0x800000"/>
          <bitfield name="EVD8" caption="Channel 8 Event Detection" mask="0x1000000"/>
          <bitfield name="EVD9" caption="Channel 9 Event Detection" mask="0x2000000"/>
          <bitfield name="EVD10" caption="Channel 10 Event Detection" mask="0x4000000"/>
          <bitfield name="EVD11" caption="Channel 11 Event Detection" mask="0x8000000"/>
        </register>
        <register name="SWEVT" offset="0x1C" rw="W" size="4" initval="0x00000000" caption="Software Event">
          <bitfield name="CHANNEL0" caption="Channel 0 Software Selection" mask="0x1"/>
          <bitfield name="CHANNEL1" caption="Channel 1 Software Selection" mask="0x2"/>
          <bitfield name="CHANNEL2" caption="Channel 2 Software Selection" mask="0x4"/>
          <bitfield name="CHANNEL3" caption="Channel 3 Software Selection" mask="0x8"/>
          <bitfield name="CHANNEL4" caption="Channel 4 Software Selection" mask="0x10"/>
          <bitfield name="CHANNEL5" caption="Channel 5 Software Selection" mask="0x20"/>
          <bitfield name="CHANNEL6" caption="Channel 6 Software Selection" mask="0x40"/>
          <bitfield name="CHANNEL7" caption="Channel 7 Software Selection" mask="0x80"/>
          <bitfield name="CHANNEL8" caption="Channel 8 Software Selection" mask="0x100"/>
          <bitfield name="CHANNEL9" caption="Channel 9 Software Selection" mask="0x200"/>
          <bitfield name="CHANNEL10" caption="Channel 10 Software Selection" mask="0x400"/>
          <bitfield name="CHANNEL11" caption="Channel 11 Software Selection" mask="0x800"/>
        </register>
        <register name="CHANNEL" offset="0x20" rw="RW" size="4" count="12" initval="0x00008000" caption="Channel n">
          <bitfield name="EVGEN" caption="Event Generator Selection" mask="0x7F"/>
          <bitfield name="PATH" caption="Path Selection" mask="0x300" values="EVSYS_CHANNEL__PATH"/>
          <bitfield name="EDGSEL" caption="Edge Detection Selection" mask="0xC00" values="EVSYS_CHANNEL__EDGSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in standby" mask="0x4000"/>
          <bitfield name="ONDEMAND" caption="Generic Clock On Demand" mask="0x8000"/>
        </register>
        <register name="USER" offset="0x80" rw="RW" size="4" count="45" initval="0x00000000" caption="User Multiplexer n">
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0x1F"/>
        </register>
      </register-group>
      <value-group name="EVSYS_CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0"/>
        <value name="RISING_EDGE" caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" value="1"/>
        <value name="FALLING_EDGE" caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" value="2"/>
        <value name="BOTH_EDGES" caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" value="3"/>
      </value-group>
      <value-group name="EVSYS_CHANNEL__PATH">
        <value name="SYNCHRONOUS" caption="Synchronous path" value="0"/>
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="1"/>
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="2"/>
      </value-group>
    </module>
    <module name="GCLK" id="U2122" version="1.1.1" caption="Generic Clock Generator">
      <register-group name="GCLK" caption="Generic Clock Generator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchroniation Busy bit" mask="0x1"/>
          <bitfield name="GENCTRL" caption="Generic Clock Generator Control Synchronization Busy bits" mask="0x7FC" values="GCLK_SYNCBUSY__GENCTRL"/>
        </register>
        <register name="GENCTRL" offset="0x20" rw="RW" size="4" count="9" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="SRC" caption="Source Select" mask="0xF" values="GCLK_GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x400"/>
          <bitfield name="OE" caption="Output Enable" mask="0x800"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x1000"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
        <register name="PCHCTRL" offset="0x80" rw="RW" size="4" count="36" initval="0x00000000" caption="Peripheral Clock Control">
          <bitfield name="GEN" caption="Generic Clock Generator" mask="0xF" values="GCLK_PCHCTRL__GEN"/>
          <bitfield name="CHEN" caption="Channel Enable" mask="0x40"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="GCLK_SYNCBUSY__GENCTRL">
        <value name="GCLK0" caption="Generic clock generator 0" value="0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="4"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="5"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="6"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="7"/>
        <value name="GCLK8" caption="Generic clock generator 8" value="8"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__SRC">
        <value name="XOSC" caption="XOSC oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="OSC32K" caption="OSC32K oscillator output" value="4"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="5"/>
        <value name="OSC16M" caption="OSC16M oscillator output" value="6"/>
        <value name="DFLL48M" caption="DFLL48M output" value="7"/>
        <value name="DPLL96M" caption="DPLL96M output" value="8"/>
      </value-group>
      <value-group name="GCLK_PCHCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
      </value-group>
    </module>
    <module name="MCLK" id="U2234" version="1.0.0" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x4"/>
          <bitfield name="EMCLK" caption="Emergency Clock Select" mask="0x10"/>
        </register>
        <register name="INTENCLR" offset="0x1" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="CFD" caption="Clock Failure Detector Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x2" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="CFD" caption="Clock Failure Detector Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x3" rw="RW" size="1" initval="0x01" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
          <bitfield name="CFD" caption="Clock Failure Detector" mask="0x2"/>
        </register>
        <register name="CPUDIV" offset="0x4" rw="RW" size="1" initval="0x01" caption="CPU Clock Division">
          <bitfield name="CPUDIV" caption="CPU Clock Division Factor" mask="0xFF" values="MCLK_CPUDIV__CPUDIV"/>
        </register>
        <register name="LPDIV" offset="0x5" rw="RW" size="1" initval="0x01" caption="Low-Power Clock Division">
          <bitfield name="LPDIV" caption="Low-Power Clock Division Factor" mask="0xFF" values="MCLK_LPDIV__LPDIV"/>
        </register>
        <register name="BUPDIV" offset="0x6" rw="RW" size="1" initval="0x01" caption="Backup Clock Division">
          <bitfield name="BUPDIV" caption="Backup Clock Division Factor" mask="0xFF" values="MCLK_BUPDIV__BUPDIV"/>
        </register>
