Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21G17A.xml
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000002" caption="Peripheral write protection status - Bridge B">
          <bitfield name="USB_" caption="USB APB Protect Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Protect Enable" mask="0x4"/>
          <bitfield name="MTB_" caption="MTB APB Protect Enable" mask="0x8"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge C">
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x2"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x4"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Protect Enable" mask="0x8"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Protect Enable" mask="0x10"/>
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x20"/>
          <bitfield name="TCC1_" caption="TCC1 APB Protect Enable" mask="0x40"/>
          <bitfield name="TCC2_" caption="TCC2 APB Protect Enable" mask="0x80"/>
          <bitfield name="TC0_" caption="TC0 APB Protect Enable" mask="0x100"/>
          <bitfield name="TC1_" caption="TC1 APB Protect Enable" mask="0x200"/>
          <bitfield name="DAC_" caption="DAC APB Protect Enable" mask="0x1000"/>
          <bitfield name="AES_" caption="AES APB Protect Enable" mask="0x2000"/>
          <bitfield name="TRNG_" caption="TRNG APB Protect Enable" mask="0x4000"/>
        </register>
        <register name="STATUSD" offset="0x40" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge D">
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Protect Enable" mask="0x2"/>
          <bitfield name="TC4_" caption="TC4 APB Protect Enable" mask="0x4"/>
          <bitfield name="ADC_" caption="ADC APB Protect Enable" mask="0x8"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x10"/>
          <bitfield name="PTC_" caption="PTC APB Protect Enable" mask="0x20"/>
          <bitfield name="OPAMP_" caption="OPAMP APB Protect Enable" mask="0x40"/>
          <bitfield name="CCL_" caption="CCL APB Protect Enable" mask="0x80"/>
        </register>
        <register name="STATUSE" offset="0x44" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge E">
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x1"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x2"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
    <module name="PM" id="U2240" version="1.0.1" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="IORET" caption="I/O Retention" mask="0x4"/>
        </register>
        <register name="SLEEPCFG" offset="0x1" rw="RW" size="1" initval="0x02" caption="Sleep Configuration">
          <bitfield name="SLEEPMODE" caption="Sleep Mode" mask="0x7" values="PM_SLEEPCFG__SLEEPMODE"/>
        </register>
        <register name="PLCFG" offset="0x2" rw="RW" size="1" initval="0x00" caption="Performance Level Configuration">
          <bitfield name="PLSEL" caption="Performance Level Select" mask="0x3" values="PM_PLCFG__PLSEL"/>
          <bitfield name="PLDIS" caption="Performance Level Disable" mask="0x80"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="PLRDY" caption="Performance Level Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="PLRDY" caption="Performance Level Ready interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="PLRDY" caption="Performance Level Ready" mask="0x1"/>
        </register>
        <register name="STDBYCFG" offset="0x8" rw="RW" size="2" initval="0x0000" caption="Standby Configuration">
          <bitfield name="PDCFG" caption="Power Domain Configuration" mask="0x3" values="PM_STDBYCFG__PDCFG"/>
          <bitfield name="DPGPD0" caption="Dynamic Power Gating for PD0" mask="0x10"/>
          <bitfield name="DPGPD1" caption="Dynamic Power Gating for PD1" mask="0x20"/>
          <bitfield name="VREGSMOD" caption="Voltage Regulator Standby mode" mask="0xC0" values="PM_STDBYCFG__VREGSMOD"/>
          <bitfield name="LINKPD" caption="Linked Power Domain" mask="0x300" values="PM_STDBYCFG__LINKPD"/>
          <bitfield name="BBIASHS" caption="Back Bias for HMCRAMCHS" mask="0xC00"/>
          <bitfield name="BBIASLP" caption="Back Bias for HMCRAMCLP" mask="0x3000"/>
          <bitfield name="BBIASPP" caption="Back Bias for PicoPram" mask="0xC000"/>
        </register>
        <register name="PWSAKDLY" offset="0xC" rw="RW" size="1" initval="0x00" caption="Power Switch Acknowledge Delay">
          <bitfield name="DLYVAL" caption="Delay Value" mask="0x7F"/>
          <bitfield name="IGNACK" caption="Ignore Acknowledge" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE0" caption="CPU clock is OFF" value="0"/>
        <value name="IDLE1" caption="AHB clock is OFF" value="1"/>
        <value name="IDLE2" caption="APB clock are OFF" value="2"/>
        <value name="STANDBY" caption="All Clocks are OFF" value="4"/>
        <value name="BACKUP" caption="Only Backup domain is powered ON" value="5"/>
        <value name="OFF" caption="All power domains are powered OFF" value="6"/>
      </value-group>
      <value-group name="PM_PLCFG__PLSEL">
        <value name="PL0" caption="Performance Level 0" value="0x0"/>
        <value name="PL1" caption="Performance Level 1" value="0x1"/>
        <value name="PL2" caption="Performance Level 2" value="0x2"/>
      </value-group>
      <value-group name="PM_STDBYCFG__LINKPD">
        <value name="DEFAULT" caption="Power domains are not linked" value="0"/>
        <value name="PD01" caption="PD0 and PD1 power domains are linked" value="1"/>
        <value name="PD12" caption="PD1 and PD2 power domains are linked" value="2"/>
        <value name="PD012" caption="All power domains are linked" value="3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__PDCFG">
        <value name="DEFAULT" caption="All power domains switching is handled by hardware." value="0"/>
        <value name="PD0" caption="PD0 is forced ACTIVE. PD1 and PD2 power domains switching is handled by hardware." value="1"/>
        <value name="PD01" caption="PD0 and PD1 are forced ACTIVE. PD2 power domain switching is handled by hardware." value="2"/>
        <value name="PD012" caption="All power domains are forced ACTIVE." value="3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__VREGSMOD">
        <value name="AUTO" caption="Automatic mode" value="0"/>
        <value name="PERFORMANCE" caption="Performance oriented" value="1"/>
        <value name="LP" caption="Low Power oriented" value="2"/>
      </value-group>
    </module>
    <module name="PORT" id="U2210" version="2.0.1" caption="Port Module">
      <register-group name="GROUP" size="0x80">
        <register name="DIR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Data Direction">
        </register>
        <register name="DIRCLR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Data Direction Clear">
        </register>
        <register name="DIRSET" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Data Direction Set">
        </register>
        <register name="DIRTGL" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Data Direction Toggle">
        </register>
        <register name="OUT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Data Output Value">
        </register>
        <register name="OUTCLR" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Data Output Value Clear">
        </register>
        <register name="OUTSET" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Data Output Value Set">
        </register>
        <register name="OUTTGL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Data Output Value Toggle">
        </register>
        <register name="IN" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Data Input Value">
        </register>
        <register name="CTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
        </register>
